{
  "lastUpdated": "2025-12-31T13:14:07.674270",
  "authors": [
    "BREAK!! RPG Blog",
    "Bastionland",
    "Prismatic Wasteland",
    "The Alexandrian",
    "d4 Caltrops"
  ],
  "posts": [
    {
      "title": "Designing the Tempest Cluster",
      "author": "The Alexandrian",
      "date": "2025-12-30T23:54:06",
      "link": "https://thealexandrian.net/wordpress/53243/roleplaying-games/designing-the-tempest-cluster",
      "summary": "The Tempest Cluster was created to be the setting for my Mothership open table. This is a peek behind the curtain for my setting prep. When I first sat down to design the cluster, I knew a few things: As an open table, the PCs would have a home base..."
    },
    {
      "title": "Tempest Cluster",
      "author": "The Alexandrian",
      "date": "2025-12-30T04:43:53",
      "link": "https://thealexandrian.net/wordpress/53237/roleplaying-games/tempest-cluster",
      "summary": "The Tempest Cluster was designed as the setting for my Mothership open table. The Tempest Cluster is located in the Shakespeare Sector, its systems rimspin of the shattered, balkanized remnants of Terran Hegemony. It was previously two unconnected..."
    },
    {
      "title": "Thought of the Day: GenAI and RPGs",
      "author": "The Alexandrian",
      "date": "2025-12-29T04:21:36",
      "link": "https://thealexandrian.net/wordpress/53232/roleplaying-games/thought-of-the-day-genai-and-rpgs",
      "summary": "There’s been Discourse™ of late about the use of GenAI/LLMs in creating RPGs. Not the artwork in an RPG book (that’s a whole ‘nother kettle of fish), but the actual design and development of the game itself: Feeding game text into ChatGPT, Claude,..."
    },
    {
      "title": "Review: Blades in the Dark – Deep Cuts",
      "author": "The Alexandrian",
      "date": "2025-12-28T04:28:12",
      "link": "https://thealexandrian.net/wordpress/53224/roleplaying-games/review-blades-in-the-dark-deep-cuts",
      "summary": "I’m a huge fan of Blades in the Dark, and I was very excited for Deep Cuts, a major expansion designed by the game’s original creator, John Harper, with additional design and writing by Sean Nittner, Pam Punzalan, and James Mendez Hodes. I backed..."
    },
    {
      "title": "Magic Item Generator",
      "author": "d4 Caltrops",
      "date": "2025-12-27T19:04:00",
      "link": "https://blog.d4caltrops.com/2025/12/magic-item-generator.html",
      "summary": "With a little bit of digital elbow grease, I’ve finally managed to create a Generator that produces Magical Items from the dozens of d100 Tables I’ve created on this topic. It’s embedded below, give it a click to generate additional Wonders and..."
    },
    {
      "title": "River Village Tikuto (Freebie, Settlement)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-12-27T03:20:00",
      "link": "https://breakrpg.blogspot.com/2025/12/river-village-tikuto-freebie-settlement.html",
      "summary": "SettlementRiver Village TikutoOne of many villages along the Deynali River, Tikuto is fairly typical of what you’d expect from a fishing town in the Sol Alliance. While very prosperous and mostly peaceful, it is not without its oddities - making a..."
    },
    {
      "title": "Ask the Alexandrian #22: Why Powered by the Apocalypse?",
      "author": "The Alexandrian",
      "date": "2025-12-24T04:55:31",
      "link": "https://thealexandrian.net/wordpress/53218/roleplaying-games/ask-the-alexandrian-22-why-powered-by-the-apocalypse",
      "summary": "G. asks: I’ve run a couple Powered by the Apocalypse games and I don’t get the hype. What are the strengths of PBTA games supposed to be compared to games like Call of Cthulhu, Vampire the Masquerade, or Savage Worlds? Let’s start with a quick..."
    },
    {
      "title": "d100 - So You've Spent Too Long At Sea...",
      "author": "d4 Caltrops",
      "date": "2025-12-23T22:27:00",
      "link": "https://blog.d4caltrops.com/2025/12/d100-so-youve-spent-too-long-at-sea.html",
      "summary": "Just as there is a Mythic Underworld and Mythic Wilds, why not also cultivate Mythic Oceans? Perhaps when one spends a bit too long aship, or adrift and lost, the Sea begins to change them. Should you find yourself in need of some rather..."
    },
    {
      "title": "d100 – Treasure Map Minutia & Cartograph Complications",
      "author": "d4 Caltrops",
      "date": "2025-12-22T13:04:00",
      "link": "https://blog.d4caltrops.com/2025/12/d100-treasure-map-minutia-cartograph.html",
      "summary": "Representing a full fourth of the Random Results when Scrolls are generated as Magical Treasure in most of the earlier presentations, Treasure Maps can sometimes end up making quite frequent appearances. B/X even recommends that the Referee prepare..."
    },
    {
      "title": "d100 - Where is that Treasure Hidden?",
      "author": "d4 Caltrops",
      "date": "2025-12-20T17:28:00",
      "link": "https://blog.d4caltrops.com/2025/12/d100-where-is-that-treasure-hidden.html",
      "summary": "As another elaboration to assist with Dungeon Stocking duties, here is a Table I’ve put together of some potential locations to secrete the occasional “Hidden Treasure” that can show up during the process. Many of the entries here also include a bit..."
    },
    {
      "title": "The Vladaam Affair – Part 17B: Undead Shipping Warehouse – Handouts",
      "author": "The Alexandrian",
      "date": "2025-12-19T21:20:32",
      "link": "https://thealexandrian.net/wordpress/53205/roleplaying-games/the-vladaam-affair-part-17b-undead-shipping-warehouse-handouts",
      "summary": "Go to Table of Contents LETTER OF CAUTION FROM SHIGMAA URASTA Arquad— These most recent requests have proven most challenging, and the resulting creations may prove both delicate and dangerous. First, the members of the danse macbre are not to be..."
    },
    {
      "title": "Ex-RPGNet Review: A Knight’s Tale",
      "author": "The Alexandrian",
      "date": "2025-12-19T13:19:36",
      "link": "https://thealexandrian.net/wordpress/53214/reviews/ex-rpgnet-review-a-knights-tale",
      "summary": "Review Originally Published May 21st, 2001 One of the first scenes in A Knight’s Tale is that of a crowd chanting and stomping their feet to Queen’s We Will Rock You while watching a medieval jousting tournament. Throughout the film – telling the..."
    },
    {
      "title": "Castle Claus: The Keep on the North Pole",
      "author": "Prismatic Wasteland",
      "date": "2025-12-18T13:50:24",
      "link": "https://www.prismaticwasteland.com/blog/castle-claus-the-keep-on-the-north-pole",
      "summary": "A Merry Hexmas location: dungeoncrawl through Santa Claus’ castle. Whether you lead an elf and reindeer uprising is up to you!"
    },
    {
      "title": "The Vladaam Affair – Part 17: Undead Shipping Warehouse",
      "author": "The Alexandrian",
      "date": "2025-12-18T13:13:38",
      "link": "https://thealexandrian.net/wordpress/53203/roleplaying-games/the-vladaam-affair-part-17-undead-shipping-warehouse",
      "summary": "Go to Table of Contents This shipping facility is used to supply undead to various unsavory interests throughout Ptolus. MARQUETTE’S TEXTILES: The front of the building masquerades as a high-class clothier. Anyone inquiring about rates, however, is..."
    },
    {
      "title": "Justin @ Green Dragon Fest!",
      "author": "The Alexandrian",
      "date": "2025-12-18T04:52:22",
      "link": "https://thealexandrian.net/wordpress/53201/roleplaying-games/justin-green-dragon-fest-2",
      "summary": "At Green Dragon Fest, you’ll escape the chaos of a typical convention’s swarms of attendees and immerse yourself in a fantasy village where you game with top YouTube dungeon masters, feast family-style, and forge a tight-knit gaming tribe. Over two..."
    },
    {
      "title": "Fragging Out",
      "author": "Bastionland",
      "date": "2025-12-17T08:48:00",
      "link": "https://www.bastionland.com/2025/12/fragging-out.html",
      "summary": "Intergalactic work continues. I'm constantly reminding myself that the first Mythic Bastionland playtests (then Primeval Bastionland) were based on an extremely rough document, with vastly different rules to how the game turned out, especially in..."
    },
    {
      "title": "5E Monster: Tomb Maiden",
      "author": "The Alexandrian",
      "date": "2025-12-17T04:50:20",
      "link": "https://thealexandrian.net/wordpress/53196/roleplaying-games/5e-monster-tomb-maiden",
      "summary": "A tomb maiden is a lithe, sinuous, and fully-articulated iron maiden. The sacrificial victim placed within the tomb maiden is animated through necromantic rites and the negative energies of its undead existence are bonded to the iron shell of the..."
    },
    {
      "title": "Buried Kingdom Items (Freebie, Gear)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-12-11T19:31:00",
      "link": "https://breakrpg.blogspot.com/2025/12/buried-kingdom-items-freebie-gear.html",
      "summary": "Hidden from the sky, scarred by war, and crawling with mysteries, the Buried Kingdoms is perhaps the most enigmatic place in all of Outer World. Over the years many strange items have been created or discovered by the folk working to thrive and..."
    },
    {
      "title": "Transit",
      "author": "Bastionland",
      "date": "2025-12-10T08:58:00",
      "link": "https://www.bastionland.com/2025/12/transit.html",
      "summary": "Setting a BearingBefore casting off, the ship must set its bearing to an agreed destination. This requires a meeting of the Bearing Council, which consists of the captain and their officers. The Bearing Council acts as a microcosm of a Captain’s..."
    },
    {
      "title": "d100 - Lair Locations",
      "author": "d4 Caltrops",
      "date": "2025-12-09T21:47:00",
      "link": "https://blog.d4caltrops.com/2025/12/d100-lair-locations.html",
      "summary": "When Stocking Hexes, I occasionally find myself at a loss when it comes to all those “Lairs” that can get generated in the Process. Those Encounters/Monsters need to shelter or sleep somewhere after all! But this can lead to leaning on the same..."
    },
    {
      "title": "Bastionland Podcast Series 6",
      "author": "Bastionland",
      "date": "2025-12-09T13:56:00",
      "link": "https://www.bastionland.com/2025/12/bastionland-podcast-series-6.html",
      "summary": "That's a wrap on another series of the Bastionland Podcast! If you haven't been following for long, here's the line up who each discussed three games that are important to them:Episode 1 - LUKE STRATTONIf you ever meet a BORG-like sceptic, point..."
    },
    {
      "title": "d100 - Heavenly Hallmarks or Gifts for the God-Touched",
      "author": "d4 Caltrops",
      "date": "2025-12-04T13:18:00",
      "link": "https://blog.d4caltrops.com/2025/12/d100-heavenly-hallmarks-or-gifts-for.html",
      "summary": "Many months ago, I completed a table for Tiefling Traits and Infernal Features in which I promised a Post pertaining to their more Angelic/Aasimaric Counterparts. I plinked away at a smattering of entries and then promptly misplaced the Table, only..."
    },
    {
      "title": "PAX Unplugged: How to Cram A Month’s Worth of Gaming Into One Weekend",
      "author": "Prismatic Wasteland",
      "date": "2025-12-02T13:37:01",
      "link": "https://www.prismaticwasteland.com/blog/pax-unplugged-2025-retrospective",
      "summary": "I played Seven Party Pact, Paranoia, Planet of the Apes RPG, Monty Python RPG, Break!!, Barkeep on the Borderlands, and Escape from Atlantis and am reporting those experiences to you from a wholly neutral and accurate perspective."
    },
    {
      "title": "Twilight Meridian Items (Freebie, Gear)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-11-30T21:36:00",
      "link": "https://breakrpg.blogspot.com/2025/11/twilight-meridian-items-freebie-gear.html",
      "summary": "The Twilight Meridian is an odd place, a region of true contrasts where dusk and dawn meet and fade away. Outer World's most active region in terms of mercantile and maritime exploits, it happens to also be the place one is most likely to find items..."
    },
    {
      "title": "d100 - Brainfood for Burgeoning Blogs",
      "author": "d4 Caltrops",
      "date": "2025-11-28T16:44:00",
      "link": "https://blog.d4caltrops.com/2025/11/d100-brainfood-for-burgeoning-blogs.html",
      "summary": "Recently, some impressive work Mapping the RPG blogosphere by elmcat had me thinking about the recent surge in new Blogs about these games. It is very exciting to see more and more people deciding to use these once more to capture their thoughts and..."
    },
    {
      "title": "Decks and Compartments",
      "author": "Bastionland",
      "date": "2025-11-26T11:48:00",
      "link": "https://www.bastionland.com/2025/11/decks-and-compartments.html",
      "summary": "Getting around a ship can sometimes be worse than getting around the galaxy. Any point on a ship is defined by its Deck and Compartment numbers. DecksStandard-sized ships have twelve decks which, beyond the reach of traditional gravity, are rarely..."
    },
    {
      "title": "Review: Honey in the Rafters",
      "author": "Prismatic Wasteland",
      "date": "2025-11-25T12:45:41",
      "link": "https://www.prismaticwasteland.com/blog/review-honey-in-the-rafters",
      "summary": "A short and sweet review of a starter adventure for Mausritter."
    },
    {
      "title": "Ludum ex Ludo",
      "author": "Bastionland",
      "date": "2025-11-19T10:48:00",
      "link": "https://www.bastionland.com/2025/11/ludum-ex-ludo.html",
      "summary": "I wonder how many games I need to make before I stop feeling shame at the very thought of talking about my creative process. Today is not that day, but let’s push through together. I’ve realised that some of my most productive work comes out of..."
    },
    {
      "title": "Wistful Dark Items (Freebie, Gear)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-11-15T02:26:00",
      "link": "https://breakrpg.blogspot.com/2025/11/wistful-dark-items-freebie-gear.html",
      "summary": "The land of eternal night is known for its bitter cold and dangerous shadows, but it gives as well as it takes. Its very nature demands a certain creativity from crafters, who are in turn provided with materials and circumstances that can't be found..."
    },
    {
      "title": "The Wheel",
      "author": "Bastionland",
      "date": "2025-11-12T11:16:00",
      "link": "https://www.bastionland.com/2025/11/the-wheel.html",
      "summary": "Starship crew refer to the reliably repetitive pattern of ship life as a rotating wheel with three handles.Transit, Dock, Layover, Transit, Dock, Layover, and so on forever. 1 - Transit: The Captain summons his Officers to discuss the ship’s next..."
    },
    {
      "title": "I’d Rather Be a Mouse Than an Elf",
      "author": "Prismatic Wasteland",
      "date": "2025-11-11T13:07:30",
      "link": "https://www.prismaticwasteland.com/blog/id-rather-be-a-mouse-than-an-elf",
      "summary": "I love pretending to be an elf just as much as the next guy, but it pales in comparison to the joys of pretending to be a mouse with a sewing needle sword at my side."
    },
    {
      "title": "Life as Crew",
      "author": "Bastionland",
      "date": "2025-11-05T10:13:00",
      "link": "https://www.bastionland.com/2025/11/life-as-crew.html",
      "summary": "Ships large enough to travel between the stars are a big investment, so most interstellar travellers get around as part of a captain’s crew. A standard sized ship has a crew nearing one-thousand souls. Below the captain, crew are split into three..."
    },
    {
      "title": "Blogwagon Announcement: Merry Hexmas",
      "author": "Prismatic Wasteland",
      "date": "2025-11-03T14:16:51",
      "link": "https://www.prismaticwasteland.com/blog/blogwagon-announcement-merry-hexmas",
      "summary": "A new blog bandwagon where everyone writes a hex for a winter wonderland hexcrawl and posts it on their blog, linking to blogs that have adjacent hexes. This announcement has all the information you need to know to participate!"
    },
    {
      "title": "Blazing Garden Items (Freebie, Gear)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-11-01T13:24:00",
      "link": "https://breakrpg.blogspot.com/2025/11/blazing-garden-items-freebie-gear.html",
      "summary": "Those wandering the Blazing Garden have to contend with the unique dangers of the region, including extreme heat, massive monsters, or the occasional overbearing devotee of the emperor. By the same token however, this does provide an opportunity to..."
    },
    {
      "title": "Bare Bones Survey of Skeletons",
      "author": "Prismatic Wasteland",
      "date": "2025-10-28T12:38:03",
      "link": "https://www.prismaticwasteland.com/blog/bare-bones-survey-of-skeletons",
      "summary": "Embracing the silly origins of skeletons and why it makes them one of the more refreshing undead horrors to use in your games."
    },
    {
      "title": "The Tax, the Tithe, and the  Levy",
      "author": "Bastionland",
      "date": "2025-10-22T07:44:00",
      "link": "https://www.bastionland.com/2025/10/the-tax-tithe-and-levy.html",
      "summary": "The life of a Knight isn’t all myth-seeking and feast-eating. Sometimes you’re called in for proper work, namely taking stuff from vassals and bringing it to their ruler. Of course, you could refuse, but such dereliction of duty is viewed poorly...."
    },
    {
      "title": "The Dreams of Inger Bax (Setting)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-10-16T12:36:00",
      "link": "https://breakrpg.blogspot.com/2025/10/the-dreams-of-inger-bax-setting.html",
      "summary": "Hubris of the 3rd AeonIt is said that no man has ever believed in wizardry more than the Akenian mage knight Inger Bax. In spite of being something of a mediocre caster, he was among the most ambitious. He was also fortunate enough to be born into..."
    },
    {
      "title": "Wilderness Stocking - Expanded",
      "author": "d4 Caltrops",
      "date": "2025-10-15T11:58:00",
      "link": "https://blog.d4caltrops.com/2025/10/wilderness-stocking-expanded.html",
      "summary": "Here is the Outdoor Companion for my Dungeon Stocking – Expanded Resource that provides similar Links and Prompts to assist with Overland Hex Stocking. As I’ve mentioned before, I often utilize the traditional B/X Stocking Table (slightly reskinned)..."
    },
    {
      "title": "Strange Knights",
      "author": "Bastionland",
      "date": "2025-10-15T07:40:00",
      "link": "https://www.bastionland.com/2025/10/strange-knights.html",
      "summary": "You’ve probably met knights from other realms, but these are different. While they resemble familiar knights in many ways, they have a different oath and a different set of feats.Not these two. They're pretty standard. KNIGHTS OF THE FENSFrom the..."
    },
    {
      "title": "d100 - Treasure Transformations or Trusty Trade Goods",
      "author": "d4 Caltrops",
      "date": "2025-10-13T21:50:00",
      "link": "https://blog.d4caltrops.com/2025/10/d100-treasure-transformations-or-trusty.html",
      "summary": "While wool-gathering today, I wondered if there could be a quick and convenient way to add a little more variety to Treasure Hoards generated via the typical Hoard Treasure Types we find in these games. While Gems, Jewelry, and Magic Items are..."
    },
    {
      "title": "d100 - Wilderness Fauna",
      "author": "d4 Caltrops",
      "date": "2025-10-09T18:17:00",
      "link": "https://blog.d4caltrops.com/2025/10/d100-wilderness-fauna.html",
      "summary": "As part of my Preparation for a new Wilderness Stocking Resource (an Overland version of my Dungeon Stocking – Expanded) I’ve identified a few potential d100 Tables that I would like to add to the pile. Although I have plenty of tables concerning..."
    },
    {
      "title": "Moonlight Glitters upon Weregild",
      "author": "Prismatic Wasteland",
      "date": "2025-10-08T12:10:26",
      "link": "https://www.prismaticwasteland.com/blog/moonlight-glitters-upon-weregild",
      "summary": "Lycanthropy is played out. Instead of using another werewolf in your game, try some weregilt."
    },
    {
      "title": "Smithers, who is that Horse God from the Dawn Age?",
      "author": "Bastionland",
      "date": "2025-10-08T09:44:00",
      "link": "https://www.bastionland.com/2025/10/smithers-who-is-that-horse-god-from.html",
      "summary": "Glorantha is a famously deep but daunting setting. I won’t try to summarise it here, but open up any of the books and you’re sure to be swarmed by proper nouns you’ve never seen before.The Glorantha-set King of Dragon Pass has one simple trick,..."
    },
    {
      "title": "d100 - Why Is This Treasure So Valuable?",
      "author": "d4 Caltrops",
      "date": "2025-10-06T14:28:00",
      "link": "https://blog.d4caltrops.com/2025/10/d100-why-is-this-treasure-so-valuable.html",
      "summary": "Sometimes, rolls on those Random Treasure Tables can often produce some surprisingly Rich Results. A piece of Jewelry, Gemstone, or even an Object d’art may be so very valuable that one is tempted to ask “Why?” We can usually conveniently couch this..."
    },
    {
      "title": "d100 - “Bottle Episodes\" - Seafaring Scenes & Situations",
      "author": "d4 Caltrops",
      "date": "2025-10-04T16:13:00",
      "link": "https://blog.d4caltrops.com/2025/10/d100-bottle-episodes-seafaring-scenes.html",
      "summary": "Long Journeys by Sea often differ from other types of Travel. Outside of Weather Changes, and the occasional Random Encounter, there is often very little to decorate them when compared to their Wilderness Exploration counterparts. The distances are..."
    },
    {
      "title": "Starting Social Bonds (Freebie)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-10-02T12:27:00",
      "link": "https://breakrpg.blogspot.com/2025/10/starting-social-bonds-freebie.html",
      "summary": "This week's entry is a preview of a small portion our next supplement START - namely, one of the procedures included in the section for fleshing out the history of the party alongside character creation. This is a way to give each player character a..."
    },
    {
      "title": "d100 - What Do Those Rations Consist of Anyway?",
      "author": "d4 Caltrops",
      "date": "2025-10-01T23:44:00",
      "link": "https://blog.d4caltrops.com/2025/10/d100-what-do-those-rations-consist-of.html",
      "summary": "Adventurers often find themselves with loudly growling bellies. The clever ones make sure that they’ve brought along some Rations for this occasion, but we rarely really delve into what those portable foodstuffs might actually be. Other than vague..."
    },
    {
      "title": "More Landmarks",
      "author": "Bastionland",
      "date": "2025-10-01T08:11:00",
      "link": "https://www.bastionland.com/2025/10/more-landmarks.html",
      "summary": "The Mythic Bastionland realm creation procedure suggests a 12x12 hex Realm, but I've drifted more toward 12x18 mostly because it's a nice easy fit to print out on a regular piece of paper. A side-effect of this is that the realm feels a little bit..."
    },
    {
      "title": "Into the Land",
      "author": "Bastionland",
      "date": "2025-09-24T06:53:00",
      "link": "https://www.bastionland.com/2025/09/into-land.html",
      "summary": "Mythic Bastionland has this spark table for it's lands.Want to go a further step deeper? Let's see how deep this place goes.--------------------------------------------------------------------------This post was originally sent as a reward to all..."
    },
    {
      "title": "Pedantic Wasteland - Outlaws of the Iron Route",
      "author": "Prismatic Wasteland",
      "date": "2025-09-23T12:57:56",
      "link": "https://www.prismaticwasteland.com/blog/pedantic-wasteland-outlaws-of-the-iron-route",
      "summary": "Reviewing one of the earliest adventures for 5th Edition D&D: how I would improve player agency and how my proposed fixes grind up against the play culture of 5e."
    },
    {
      "title": "Freebie: MONSTRICH (Adversary)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-09-20T01:47:00",
      "link": "https://breakrpg.blogspot.com/2025/09/freebie-monstrich-adversary.html",
      "summary": "This weeks entry is an adversary that addresses three things: sometimes ordinary wildlife can be dangerous enough as is, ordinary wildlife on Outer World is still pretty strange, and the funniest method of attack is hitting a character with another..."
    },
    {
      "title": "Building Bastionland - A Career Retrospective",
      "author": "Bastionland",
      "date": "2025-09-17T07:30:00",
      "link": "https://www.bastionland.com/2025/09/building-bastionland-career.html",
      "summary": "I’ve been making games professionally for long enough now that people sometimes ask me how I got here. I don’t really know the answer, but I know these things are true: I’d be designing games anyway, even if nobody bought them. The popularity of..."
    },
    {
      "title": "Mythic Feasts",
      "author": "Bastionland",
      "date": "2025-09-10T09:28:00",
      "link": "https://www.bastionland.com/2025/09/mythic-feasts.html",
      "summary": "What makes a Feast? Three things, as you’d expect.Ceremony - How is the official purpose of the feast observed?Spectacle - How is the host showing off how wealthy, powerful, or important they are?Revelry - You think anyone would show up if you..."
    },
    {
      "title": "Pick Two Inspirations and Combine Them",
      "author": "Prismatic Wasteland",
      "date": "2025-09-08T14:13:42",
      "link": "https://www.prismaticwasteland.com/blog/pick-two-inspirations-and-combine-them",
      "summary": "I present a cheat code for breaking through writer’s block and coming up with a gameable idea from all the cultural detritus that has built up inside your brain."
    },
    {
      "title": "Assorted rules for Sequel Sagas (Freebie)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-09-08T02:03:00",
      "link": "https://breakrpg.blogspot.com/2025/09/assorted-rules-for-sequel-sagas-freebie.html",
      "summary": "If run by the book, BREAK!! gives players a good indication of where to end a saga. Namely, achieving Rank 10 and going on one final big adventure to wrap up a game. What happens next depends on your group - it's very likely you'll take a different..."
    },
    {
      "title": "Holding Threads",
      "author": "Bastionland",
      "date": "2025-09-03T09:30:00",
      "link": "https://www.bastionland.com/2025/09/holding-threads.html",
      "summary": "You’ll have noticed that if you stick around a holding in Mythic Bastionland then the land is, well, less mythic. In fact, Myths kind of pause when the Knights aren’t out exploring.That’s the way of this mythic world. Go ask the Seers if you want to..."
    },
    {
      "title": "Mythic Rivers",
      "author": "Bastionland",
      "date": "2025-08-26T14:32:00",
      "link": "https://www.bastionland.com/2025/08/mythic-rivers.html",
      "summary": "Not The River, of course. A typical Mythic Bastionland realm, following the procedure in the book, has a navigable river. It’s an extremely fast way to get around! You might put some barriers alongside it if you want to represent especially..."
    },
    {
      "title": "Setting: Manny Perez",
      "author": "BREAK!! RPG Blog",
      "date": "2025-08-24T18:39:00",
      "link": "https://breakrpg.blogspot.com/2025/08/setting-manny-perez.html",
      "summary": "Formerly one of many rank and file employees working at Infinite Possibility Foundation, Manny Perez was the definition of a paper pusher. He couldn't tell you exactly what his employers did (\"I think we make phones\") but he knew what he did - it's..."
    },
    {
      "title": "Dumpster Deep Dive: You Got a Job on the Garbage Barge Prep Example",
      "author": "Prismatic Wasteland",
      "date": "2025-08-19T12:45:38",
      "link": "https://www.prismaticwasteland.com/blog/dumpster-deep-dive-you-got-a-job-on-the-garbage-barge-prep-example",
      "summary": "An example for our I prepared to run a (great) published adventure."
    },
    {
      "title": "BREAK!! RPG Character Art Pack by LeviLagaan",
      "author": "BREAK!! RPG Blog",
      "date": "2025-08-17T19:00:00",
      "link": "https://breakrpg.blogspot.com/2025/08/break-rpg-character-art-pack-by.html",
      "summary": "Artist Levil has created an awesome art pack of character portraits for a variety of BREAK!! characters. Check it out here!"
    },
    {
      "title": "d100 - Side Effects from Bargain Basement Potions",
      "author": "d4 Caltrops",
      "date": "2025-08-15T09:48:00",
      "link": "https://blog.d4caltrops.com/2025/08/d100-side-effects-from-bargain-basement.html",
      "summary": "In most of my Campaign Settings, I try to emphasize that Magic is a rather Rare and Wonderous thing. You’ll seldom find Arcane Artifacts for Sale in Markets and generally you must locate them through Adventure. But some Settings are slightly less..."
    },
    {
      "title": "Two Sorts of Small Gods (Freebie Encounter/Adversary)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-08-10T02:59:00",
      "link": "https://breakrpg.blogspot.com/2025/08/two-sorts-of-small-gods-freebie.html",
      "summary": "As described in the previous entry, small gods come in a variety of forms. This entry discusses the enduring cloud gods and the enigmatic forest gods.These two sorts of small gods are very different, so they are presented in a contrasting way. Cloud..."
    },
    {
      "title": "A \"How to play BREAK!!\" Video by Weird Place!",
      "author": "BREAK!! RPG Blog",
      "date": "2025-08-09T00:23:00",
      "link": "https://breakrpg.blogspot.com/2025/08/a-how-to-play-break-video-by-weird-place.html",
      "summary": "The youtube channel Weird Place has done a fantastic run-down of BREAK!!'s rules in video format. Check it out:"
    },
    {
      "title": "The Knightly Grind",
      "author": "Bastionland",
      "date": "2025-08-06T12:38:00",
      "link": "https://www.bastionland.com/2025/08/the-knightly-grind.html",
      "summary": "Just got back from GenCon, so this one is fuelled by jet lag. In triple Ennie award winning smash hit Mythic Bastionland there are a number of effects that can cause Virtue Loss, wearing the Knights down so that they often aren't functioning at 100%..."
    },
    {
      "title": "AI and Empty Art",
      "author": "Prismatic Wasteland",
      "date": "2025-08-05T12:27:13",
      "link": "https://www.prismaticwasteland.com/blog/ai-and-empty-art",
      "summary": "On the perils of artificial intelligence when it comes to the tabletop gaming medium."
    },
    {
      "title": "Impairing Impairing",
      "author": "Bastionland",
      "date": "2025-07-30T14:19:00",
      "link": "https://www.bastionland.com/2025/07/impairing-impairing.html",
      "summary": "Much has been discussed about the ease or deadliness of combat in Mythic Bastionland and I think the following can all be true at the same time.Combat is fast and brutal and a well-prepared group of Knights can be pretty devastating. I like having a..."
    },
    {
      "title": "The small gods (Setting)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-07-25T19:24:00",
      "link": "https://breakrpg.blogspot.com/2025/07/the-small-gods-setting.html",
      "summary": "The end of the 1st Aeon brought on a consistency previously unknown to Outer World. With the land no longer being remade at the constant whims of the Unshaped, the folk settled and so did the flow of mana. Among the phenomenon that occurred with..."
    },
    {
      "title": "d72 Squires",
      "author": "Bastionland",
      "date": "2025-07-23T12:55:00",
      "link": "https://www.bastionland.com/2025/07/d72-squires.html",
      "summary": "By the book, Squires get a pony, a dagger, and an okay weapon from a d6 table. Want to give your Squires a bit more flavour? Roll d6 and d12, reading them in that order. Remember you can combine these with the spark tables and prompts in the..."
    },
    {
      "title": "Guidance from the Seers - A Mythic Bastionland FAQ",
      "author": "Bastionland",
      "date": "2025-07-17T14:13:00",
      "link": "https://www.bastionland.com/2025/07/guidance-from-seers-mythic-bastionland.html",
      "summary": "Sticking this here for ease of access and update. With thanks to Udy Kumra in the discord for getting this started.Do Scars remove Virtues permanently?No. They are temporary as standard. If it's a permanent change (typically only from ageing or..."
    },
    {
      "title": "d100 - Vignettes for Faerie & Other Unseen Lands",
      "author": "d4 Caltrops",
      "date": "2025-07-16T20:55:00",
      "link": "https://blog.d4caltrops.com/2025/07/d100-vignettes-for-faerie-other-unseen.html",
      "summary": "When the Characters find themselves haplessly traipsing about in very strange places, be it Dolmenwood’s Realms of Fairy, the Gardens of Ynn, or even the odd Elfin Woodland (just beyond the fields we know so well, etc.), I often find it useful to..."
    },
    {
      "title": "Lego Rock Raiders as Space Horror",
      "author": "Prismatic Wasteland",
      "date": "2025-07-16T13:33:13",
      "link": "https://www.prismaticwasteland.com/blog/lego-rock-raiders-as-space-horror",
      "summary": "You are stranded on a hostile planet, but fortunately its subterranean tunnels are rich with the fuel you need to get back home. Less fortunately the tunnels are also home to hulking monsters that can break into your ship and drink its fuel."
    },
    {
      "title": "Killable Peoples",
      "author": "Prismatic Wasteland",
      "date": "2025-07-14T12:50:17",
      "link": "https://www.prismaticwasteland.com/blog/killable-peoples",
      "summary": "It says something about your game’s setting if orcs can be killed on sight by “good” characters just as it says something entirely different if you can wantonly slay bandits without remorse. I detail lots of different potential targets for violence..."
    },
    {
      "title": "FREEBIE: Sergeant (Adversary)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-07-12T01:51:00",
      "link": "https://breakrpg.blogspot.com/2025/07/freebie-sergeant-adversary.html",
      "summary": "I found myself thinking a lot about first boss of the video game Final Fight earlier this week. For the unfamiliar, he's a big fella who occasionally leaps into the background of the screen and whistles for his lackeys to come in and fight you in..."
    },
    {
      "title": "Ennies Good?? Also, by Total Coincidence, I Am Nominated for Some",
      "author": "Prismatic Wasteland",
      "date": "2025-07-11T17:55:50",
      "link": "https://www.prismaticwasteland.com/blog/ennies-good-also-by-total-coincidence-i-am-nominated-for-some",
      "summary": "Look, I’m just as surprised and delighted as I’m sure you are."
    },
    {
      "title": "d100 - Alliterative Alehouses & Tavern Traits",
      "author": "d4 Caltrops",
      "date": "2025-07-05T16:28:00",
      "link": "https://blog.d4caltrops.com/2025/07/d100-alliterative-alehouses-tavern.html",
      "summary": "Perhaps we have the venerable “Prancing Pony” to thank for it, but for some reason it seems that most Taverns seem to be a bit more memorable when given Names, and I often see those Names sharing those starting sounds. So, for an amusing..."
    },
    {
      "title": "d100 - Magical Teas & Tinctures",
      "author": "d4 Caltrops",
      "date": "2025-07-03T20:35:00",
      "link": "https://blog.d4caltrops.com/2025/07/d100-magical-teas-tinctures.html",
      "summary": "It seems only natural that a Setting with various Magical Plants & Herbs might also have some Tantalizing Teas. Most of these I imagine work a bit more like Magical Potions (and I suppose in a pinch, most entries here could augment those lists) but..."
    },
    {
      "title": "d100 - Random Rivers",
      "author": "d4 Caltrops",
      "date": "2025-07-01T22:22:00",
      "link": "https://blog.d4caltrops.com/2025/07/d100-random-rivers.html",
      "summary": "For this Quick Table I decided to take the same approach that I embarked on for my Some City Streets Table. Naming things is something I’m very fond of, because they often make those Rumors/Hooks/NPC Directions a lot more interesting when they are..."
    },
    {
      "title": "Advantage by Default",
      "author": "Prismatic Wasteland",
      "date": "2025-07-01T13:14:22",
      "link": "https://www.prismaticwasteland.com/blog/advantage-by-default",
      "summary": "Instead of punishing being over-encumbered, would players be more willing to track their inventory if we rewarded being under-encumbered?"
    },
    {
      "title": "Four Famous Fishin' Holes in Outer World (Setting)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-06-29T02:59:00",
      "link": "https://breakrpg.blogspot.com/2025/06/four-famous-fishin-holes-in-outer-world.html",
      "summary": "Last blog entry we talked about fishing - it seems appropriate to talk a bit about a few Fishing Sites for this one. Discussed here are some storied places to cast your rod in every corner of Outer World.The Pearlescent Pond (Murk)In one of the many..."
    },
    {
      "title": "d100 - Magical Lamps & Lanterns",
      "author": "d4 Caltrops",
      "date": "2025-06-28T19:51:00",
      "link": "https://blog.d4caltrops.com/2025/06/d100-magical-lamps-lanterns.html",
      "summary": "While I was gathering subjects for my prior Magic Tools post, I combed the more conventional Equipment Lists for some ideas for which additional items might benefit from a little Wonder. When I saw the Lantern, I knew that these would likely deserve..."
    },
    {
      "title": "d100 - Pecuniary Problems, Awful Arrears, & Delinquent Debts",
      "author": "d4 Caltrops",
      "date": "2025-06-21T20:41:00",
      "link": "https://blog.d4caltrops.com/2025/06/d100-pecuniary-problems-awful-arrears.html",
      "summary": "Below is a Random Table full of potential ideas for Financial Dilemmas and Predicaments that could keep those Characters a little more Cash-Strapped. I suppose this could be used for saddling those Starting Characters with a bit of Debt that could..."
    },
    {
      "title": "What Is a Roleplaying Game: The Roleplaying Game",
      "author": "Prismatic Wasteland",
      "date": "2025-06-17T13:12:45",
      "link": "https://www.prismaticwasteland.com/blog/what-is-a-roleplaying-game-the-roleplaying-game",
      "summary": "A roleplaying game about explaining what a roleplaying game is."
    },
    {
      "title": "Adventure Hooks - Fishing activity for the BREAK!! Tabletop RPG (Freebie)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-06-14T00:56:00",
      "link": "https://breakrpg.blogspot.com/2025/06/adventure-hooks-fishing-activity-for.html",
      "summary": "A lot of people joke that every RPG needs a fishing mini-game. While I think the jury is still out there on that one, I do think it makes a fun downtime activity for BREAK!! - below are some simple rules and a nice list of fish so you can..."
    },
    {
      "title": "The Languages of D&D Imply a Specific Setting",
      "author": "Prismatic Wasteland",
      "date": "2025-06-03T12:51:20",
      "link": "https://www.prismaticwasteland.com/blog/the-languages-of-dnd-imply-a-specific-setting",
      "summary": "If you start from the premise that languages in D&D make sense you can extrapolate a bit about its implied setting."
    },
    {
      "title": "The Stubborn (but friendly) Dead (Setting)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-05-31T01:57:00",
      "link": "https://breakrpg.blogspot.com/2025/05/the-stubborn-but-friendly-dead-setting.html",
      "summary": "Sometimes the dead of Outer World do not stay dead. Skelemen harbor wicked ambitions, phantoms lash out at the living, the winter myrmidons seek to coat their icy blades with warm blood. But of course, not all of the Stubborn Dead are a threat to..."
    },
    {
      "title": "Remember Books? They’re Back, in Blog Form",
      "author": "Prismatic Wasteland",
      "date": "2025-05-20T12:32:00",
      "link": "https://www.prismaticwasteland.com/blog/remember-books-theyre-back-in-blog-form",
      "summary": "If the best TTRPG writing has, for at least a decade, proliferated online (which it has), shouldn’t we start putting that writing where it belongs on our bookshelves?"
    },
    {
      "title": "Freebie: \"Trooper Armjoe\" (Gear)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-05-17T18:57:00",
      "link": "https://breakrpg.blogspot.com/2025/05/freebie-trooper-armjo-gear.html",
      "summary": "Gleysian engineers understood all too well that they could not match the towering gigaframes and bio-titans of their rivals during the 3rd Aeon. While puretech had advantages in terms of practicality and efficiency, creating such staggeringly large..."
    },
    {
      "title": "Divine Magic Works in Mysterious Ways",
      "author": "Prismatic Wasteland",
      "date": "2025-05-07T12:31:00",
      "link": "https://www.prismaticwasteland.com/blog/divine-magic-works-in-mysterious-ways",
      "summary": "I’ve spilt so much digital ink about making a wizard’s magic feel more arcane, but now it is time to think about how to make a cleric’s magic feel more divine."
    },
    {
      "title": "The Octia Scroll - The proliferation of Puretech (Setting)",
      "author": "BREAK!! RPG Blog",
      "date": "2025-05-03T00:13:00",
      "link": "https://breakrpg.blogspot.com/2025/05/the-octia-scroll-proliferation-of.html",
      "summary": "While mostly forgotten at this point in history, at its height the Technocracy of Gleys initiated a policy that would have numerous lasting effects on Outer World - both intended and not. Gleys is famous today for the variety of techno relics that..."
    },
    {
      "title": "Babies in Dungeons",
      "author": "Prismatic Wasteland",
      "date": "2025-04-22T12:56:50",
      "link": "https://www.prismaticwasteland.com/blog/babies-in-dungeons",
      "summary": "Why the hell would you bring a baby into the dungeon? Here are some rules to adjudicate your foolhardy endeavor if your character is saddled with a bundle of joy and can’t afford a babysitter."
    }
  ]
}