{
  "feed": {
    "title": "The Helical Expeditions - BREAK!! Adventures",
    "description": "WIP booklet of 3-4 page adventures for the BREAK!! TTRPG, set across the Outer World's locations. New adventures published as they are completed.",
    "link": "http://its.quagg.studio/the-helical-expeditions/",
    "language": "en-us",
    "author": "Quagg Studio"
  },
  "adventures": [
    {
      "file": "1-fishy-business.html",
      "title": "Deal with a Sea Witch",
      "region": "The Twilight Meridian",
      "sublocation": "Sunken Isles",
      "location": "Dia, Beneath the Waves",
      "rank": "7-8",
      "description": "A meal at the most popular dining spot in town takes a bizarre turn when the chef reports that his ingredients have started fighting back. The party must intervene to stop the chaos that ensues, before finding the anomaly's source.",
      "publishDate": "2025-12-18"
    },
    {
      "file": "2-danger-for-a-rokko-do.html",
      "title": "Danger for a Rokko-Do",
      "region": "The Twilight Meridian",
      "sublocation": "Seven Holy Isles",
      "location": "Winding Pass",
      "rank": "2-3",
      "description": "As poachers close in on an expectant Prism Rokko-Do mother, a passionate conservationist will do everything in his power to protect the animal and her unborn chicks. That includes hiring the party to travel with him to the frozen tundra and guard the eggs after they're laid until the mother regains strength.",
      "publishDate": "2025-12-20"
    },
    {
      "file": "3-thunda-circuit.html",
      "title": "Thunda Circuit",
      "region": "Blazing Garden",
      "sublocation": "Thunda Sands",
      "location": "Deadstone",
      "rank": "3-4",
      "description": "The party sign up as last-minute entrants in the legendary 'Thunda Circuit', and are given their pick of Skimmer Teams to join for the notoriously chaotic race. So, strap yourself in, try to stay inside the Skimmer, and prepare for a thrilling ride.",
      "publishDate": "2025-12-22"
    },
    {
      "file": "4-crash-landing.html",
      "title": "Crash Landing!",
      "region": "Blazing Garden",
      "sublocation": "No-Folk Land",
      "location": "Death Valley",
      "rank": "5-6",
      "description": "The party find themselves on a flight over the inhospitable Death Valley of No-Folk Land on their way to a research contract up north. A comfortable ride turns turbulent when they crash in the desert.",
      "publishDate": "2025-12-23"
    },
    {
      "file": "5-sinking-float-stone.html",
      "title": "Sinking the Float Stone Mine",
      "region": "The Twilight Meridian",
      "sublocation": "Seven Holy Isles",
      "location": "Go Isle's Float Stone Mine",
      "rank": "5-6",
      "description": "Two witnesses in a floating island mining malpractice whistleblowing scheme have been placed into the party's care. Their testimonies are damning. Can the party escort the whistleblowers to court before someone tries to silence them?",
      "publishDate": "2025-12-25"
    },
    {
      "file": "6-hold-the-wall.html",
      "title": "Hold the Wall",
      "region": "Wistful Dark",
      "sublocation": "Aiden",
      "location": "The Red Wall",
      "rank": "8-9",
      "description": "Aiden's Wall has stood for centuries against the Hollow Queen's hordes. When a routine inspection reveals its Spell Engines are failing, an emergency task force is gathered. The party must stand alongside The Red Blades against the \"children\" of the Queen while repairs are made.",
      "publishDate": "2025-12-27"
    },
    {
      "file": "7-day-of-rekindled-lights.html",
      "title": "Day of Rekindled Lights",
      "region": "Wistful Dark",
      "sublocation": "Shadowed Lands",
      "location": "Grim Crossing",
      "rank": "1-2",
      "description": "On the night before a remembrance ceremony for the Knights of the Lantern, the party find that one fallen Knight is no longer resting in peace. They must work with a local priest to help the Knight's soul find rest before the ceremony, but not all is as holy as it seems for the clergy in town.",
      "publishDate": "2026-01-03"
    },
    {
      "file": "8-pricklys-situation.html",
      "title": "Prickly's Prickly Situation",
      "region": "Blazing Garden",
      "sublocation": "Thunda Sands",
      "location": "Cereus Plateau",
      "rank": "1-2",
      "description": "When a beloved tavern owner's daughter goes missing, he entrusts the party with the ransom money that has been demanded by a group of hostage takers. The party should expect dangerous dealings in dangerous sands, because nothing in the Thunda Sands is ever simple as a fair trade.",
      "publishDate": "2025-12-29"
    },
    {
      "file": "9-of-cats-and-a-rat.html",
      "title": "Of Cats and a Rat",
      "region": "Blazing Garden",
      "sublocation": "Pride Coast",
      "location": "Nyanko",
      "rank": "3-4",
      "description": "The gig? Simple. Head to the Nyanko alleyways, hand off a token, and receive a bag of Puretech Salvage. Despite the simple task completed, things go south for the party when their rendezvous point with their contractor gets busted...while they're there! The party must escape through the city sewers and make it to a safehouse, unnoticed.",
      "publishDate": "2025-12-31"
    }
  ]
}
